# Loading the .csv files

In [34]:
import pandas as pd

In [35]:
transactions = pd.read_csv('transactions.csv')
products = pd.read_csv('products.csv')
customers = pd.read_csv('customers.csv')

# Part A: Data Loading & Basic Operations

## Basic Exploration

In [36]:
transactions.shape

(10015, 7)

In [37]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10015 entries, 0 to 10014
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  10015 non-null  int64
 1   customer_id     10015 non-null  int64
 2   product_id      10015 non-null  int64
 3   quantity        9918 non-null   float64
 4   price           9913 non-null   float64
 5   timestamp       10015 non-null  object
 6   payment_method  9914 non-null   object
dtypes: float64(2), int64(3), object(2)
memory usage: 547.8+ KB

In [38]:
transactions.head(3)

,transaction_id,customer_id,product_id,quantity,price,timestamp,payment_method
0,4292,130,89,1.0,112.87,2024-08-17 09:13:00,Credit Card
1,9107,271,98,1.0,211.90,2023-11-17 20:50:00,PayPal
2,7842,66,33,1.0,225.04,2023-03-21 23:23:00,Bank Transfer

In [39]:
products.shape

(150, 5)

In [40]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    150 non-null    int64
 1   product_name  150 non-null    object
 2   category      147 non-null    object
 3   supplier_id   150 non-null    int64
 4   cost_price    150 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 6.0+ KB

In [41]:
products.head(3)

   product_id   product_name category  supplier_id  cost_price
0           1  Product_OFF_0     Toys           28      113.16
1           2  Product_SPO_1    Books           43      166.06
2           3  Product_SPO_2    Books           47      128.13

In [42]:
customers.shape

(2000, 6)

In [43]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    2000 non-null   int64
 1   customer_name  2000 non-null   object
 2   email          1947 non-null   object
 3   signup_date    2000 non-null   object
 4   country        2000 non-null   object
 5   age            1900 non-null   float64
dtypes: float64(1), int64(1), object(4)
memory usage: 93.9+ KB

In [44]:
customers.head(3)

,customer_id,customer_name,email,signup_date,country,age
0,1,Customer41,customer410@yahoo.com,2022-01-28,UK,30.0
1,2,Custome41,custome411@email.com,2023-10-28,Mexico,29.0
2,3,customer41,customer412@email.com,2023-04-05,Australia,69.0

In [45]:
# Number of duplicate transaction_id entries
transactions.duplicated('transaction_id').sum()

15

## Datetime Transformation

In [46]:
# converting object datatype to datetime
transactions['timestamp'] = pd.to_datetime(transactions['timestamp'])

In [47]:
transactions['hour'] = transactions['timestamp'].dt.hour

transactions['day'] = transactions['timestamp'].dt.day

transactions['day_name'] = transactions['timestamp'].dt.day_name()

transactions['month'] = transactions['timestamp'].dt.month_name()

transactions['year'] = transactions['timestamp'].dt.year

transactions.head()

,transaction_id,customer_id,product_id,quantity,price,timestamp,payment_method,hour,day,day_name,month,year
0,4292,130,89,1.0,112.87,2024-08-17 09:13:00,Credit Card,9,17,Saturday,August,2024
1,9107,271,98,1.0,211.90,2023-11-17 20:50:00,PayPal,20,17,Friday,November,2023
2,7842,66,33,1.0,225.04,2023-03-21 23:23:00,Bank Transfer,23,21,Tuesday,March,2023
3,3485,432,73,1.0,72.20,2024-11-18 17:04:00,Cash,17,18,Monday,November,2024
4,8929,248,11,1.0,315.22,2024-09-14 19:19:00,Cash,19,14,Saturday,September,2024

In [48]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10015 entries, 0 to 10014
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  10015 non-null  int64
 1   customer_id     10015 non-null  int64
 2   product_id      10015 non-null  int64
 3   quantity        9918 non-null   float64
 4   price           9913 non-null   float64
 5   timestamp       10015 non-null  datetime64[ns]
 6   payment_method  9914 non-null   object
 7   hour            10015 non-null  int32
 8   day             10015 non-null  int32
 9   day_name        10015 non-null  object
 10  month           10015 non-null  object
 11  year            10015 non-null  int32
dtypes: datetime64[ns](1), float64(2), int32(3), int64(3), object(3)
memory usage: 821.7+ KB

In [49]:
# Date range of transactions (earliest and latest)
print(f"Earliest Transaction : {transactions['timestamp'].min()}")
print(f"Latest Transaction : {transactions['timestamp'].max()}")

Earliest Transaction : 2023-01-01 00:39:00
Latest Transaction : 2024-12-31 22:18:00

# Part B: Data Cleaning & Transformation

## Handling Missing Values